In [2]:
import pandas as pd
import numpy as np
from numpy import nan as NA
from pandas import Series, DataFrame

- 누락된 데이터 골라내기
  - dropna 함수를 이용하는 방법 등 여러 방법이 있을 수 있다
  - dropna 함수를 이용하는 것이 유용한 방법이며, 사용 결과값으로 Series객체를 반환

In [4]:
data = Series([1, NA, 3.4, NA, 8])
data.dropna()

0    1.0
2    3.4
4    8.0
dtype: float64

- 
  - Boolean 색인을 이용해서 직접 계산한 후 가져오기

In [5]:
data.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [7]:
data[data.notnull()]

0    1.0
2    3.4
4    8.0
dtype: float64

- DataFame에서 누락된 데이터를 골라내기
  - dropna는 기본적으로 NA값이 하나라도 있는 로우는 제외시킨다.

In [9]:
data = DataFrame([[1, 5.5, 3],
                  [1, NA, NA],
                  [NA, NA, NA],
                  [NA, 3.3, 3]])
data

     0    1    2
0  1.0  5.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  3.3  3.0

In [11]:
data.dropna()

     0    1    2
0  1.0  5.5  3.0

- how='all' 옵션을 주면 모든 값이 NA인 행만 제외된다.

In [12]:
data.dropna(how = 'all')

     0    1    2
0  1.0  5.5  3.0
1  1.0  NaN  NaN
3  NaN  3.3  3.0

In [13]:
data[4] = NA
data

     0    1    2   4
0  1.0  5.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  3.3  3.0 NaN

In [16]:
data.dropna(how = 'all', axis = 1)

     0    1    2
0  1.0  5.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  3.3  3.0

In [19]:
data2 = DataFrame([[1, 2, 3, NA],
                   [NA, 33, 11, NA],
                   [11, NA, NA, NA],
                   [43, NA, NA, NA]])
data2

      0     1     2   3
0   1.0   2.0   3.0 NaN
1   NaN  33.0  11.0 NaN
2  11.0   NaN   NaN NaN
3  43.0   NaN   NaN NaN

- 몇 개의 value가 들어 있는 행을 가져오고 싶을 경우 사용되는 인자는 thresh

In [21]:
data2.dropna(thresh = 2)

     0     1     2   3
0  1.0   2.0   3.0 NaN
1  NaN  33.0  11.0 NaN

- 누락된 값을 채우기
  - DataFrame에서는 누락된 데이터를 완벽하게 골라낼 수 가 없으므로
  - 다른 데이터도 함께 버려지게 된다. 이런 경우에는 fillna메서드를 활용해서
  - 비어있는 값을 채워주면 데이터의 손실을 막을 수 있다.

In [22]:
data2.fillna(0)

      0     1     2    3
0   1.0   2.0   3.0  0.0
1   0.0  33.0  11.0  0.0
2  11.0   0.0   0.0  0.0
3  43.0   0.0   0.0  0.0

- fillna의 활용에 따라 각 칼럼마다 다른 값을 채워넣을 수 있다.

In [23]:
data2.fillna({
    1 : 10,
    3 : 30
})

      0     1     2     3
0   1.0   2.0   3.0  30.0
1   NaN  33.0  11.0  30.0
2  11.0  10.0   NaN  30.0
3  43.0  10.0   NaN  30.0

In [25]:
data2.fillna(method = 'ffill', limit = 1)

      0     1     2   3
0   1.0   2.0   3.0 NaN
1   1.0  33.0  11.0 NaN
2  11.0  33.0  11.0 NaN
3  43.0   NaN   NaN NaN

In [27]:
data3 = Series([1, NA, 4, NA, 7])
data3.fillna(data3.mean())

0    1.0
1    4.0
2    4.0
3    4.0
4    7.0
dtype: float64